src/InformationRegisters/дкл_ПользователиСкладов/дкл_ПользователиСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_ПользователиСкладов</name>
  <resources>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроверятьАвторизациюНаАСХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Роль</name>
    <type>
      <types>EnumRef.дкл_РолиПользователей</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.дкл_Статусы</types>
    </type>
  </resources>
  <resources>
    <name>УправлениеЧерез1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>active_</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>firstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>lastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>login</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>middleName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>position</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remotePassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remoteAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remoteLogin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>rfid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>role</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>userId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/дкл_ПользователиСкладов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначениеКопирования") Тогда    
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования.userId) Тогда   
			// при копировании:
			Запись.userId = Строка(Новый УникальныйИдентификатор);
			Запись.login = Неопределено;	
			Запись.password = Неопределено;	
			Запись.remoteLogin = Неопределено;	
			Запись.remotePassword = Неопределено;	
			Запись.rfid = Неопределено; 
			Запись.ПроверятьАвторизациюНаАСХ = Ложь;    
			Запись.active_ = Ложь;
			Запись.УправлениеЧерез1С = Ложь;  
			Запись.Пользователь = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АктивнаПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ПользовательПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура loginПриИзменении(Элемент)
	Запись.login = СокрЛП(СтрЗаменить(Запись.login, " ", ""));
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЧерез1СПриИзменении(Элемент)
	Если Запись.УправлениеЧерез1С И НЕ ЕстьРольДляУправленияПолками(Запись.Пользователь)Тогда
		Запись.УправлениеЧерез1С = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"У пользователя не достаточно прав для управления АСХ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сгенерировать(Команда)
	Если ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Запись.userId = Строка(Запись.Пользователь.УникальныйИдентификатор());
	Иначе
		Запись.userId = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВАСХ(Команда)       
	
	Если Модифицированность Тогда
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("ОтправкаВАСХ");
		Записать(ПараметрыЗаписи);	
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		ОтправитьВАСХНаСервере();	
	КонецЕсли; 

	Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Если Запись.active_ Тогда
		Элементы.ГруппаАСХОпции.Видимость = Истина;
	Иначе
		Элементы.ГруппаАСХОпции.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.userId) Тогда
		Элементы.Сгенерировать.Видимость = Ложь;
	Иначе
		Элементы.Сгенерировать.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПользовательПриИзмененииНаСервере()

	Реквизиты = 
		РегистрыСведений.дкл_ПользователиСкладов.ПолучитьРеквизитыПользователяСклада(Запись);
		
	Если ЗначениеЗаполнено(Запись.userId) Тогда
		ЗаполнитьЗначенияСвойств(Запись, Реквизиты, , "userId, login");	
	Иначе
		ЗаполнитьЗначенияСвойств(Запись, Реквизиты, , "login");	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.login) Тогда
		ЗаполнитьЗначенияСвойств(Запись, Реквизиты, "login");	
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Запись.ПроверятьАвторизациюНаАСХ = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьРольДляУправленияПолками(Пользователь)
	Возврат РегистрыСведений.дкл_ПользователиСкладов.ЕстьРольДляУправленияПолками(
					Пользователь);
КонецФункции

&НаСервере
Процедура ОтправитьВАСХНаСервере()    
	
	дкл_ОбменДаннымиСервер.ВыгрузитьПользователейСклада(
		Запись.НастройкаСклада, ,Запись.userId);
		
КонецПроцедуры

#КонецОбласти
